app/Views/layout/sidebar.php

$roleUsed  = $demoRole ?? $realRole;

$unitModel    = new \App\Models\UnitModel();
$units        = $unitModel->orderBy('name')->findAll();
---
SELECT *
FROM `units`
WHERE `units`.`deleted_at` IS NULL
ORDER BY `name`