app/Filters/UnitAccessFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $segments = service('uri')->getSegments();
        $id = (int) ($segments[1] ?? 0);
        if (!$id) return redirect()->to('/meetings');

        $meeting = (new MeetingModel())->find($id);
---
SELECT *
FROM `meetings`
WHERE `meetings`.`deleted_at` IS NULL
AND `meetings`.`id` = 111