app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'super.admin@example.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function attempt(): RedirectResponse
    {
        $email = $this->request->getPost('email');
        $pass  = $this->request->getPost('password');

        $user = (new UserModel())->where('email', $email)->first();