app/Controllers/Meetings.php

        $showUnitSelect = ($roleUsed === 'superadmin' && empty($selectedUnit));

        // Toplantılara birim adını ekle
        $units = $unitModel->orderBy('name')->findAll();
---
SELECT *
FROM `units`
WHERE `units`.`deleted_at` IS NULL
ORDER BY `name`

    public function show(int $id)
{
    $user = session('user');
    if (!$user) {
        return redirect()->to('/login');
    }

    $meeting = (new MeetingModel())->find($id);
    if (!$meeting) {
        return redirect()->to('/meetings')->with('error', 'Toplantı bulunamadı.');
    }

    // Üye, sadece kendi birimindeki toplantılara girebilir
    if ($user['role'] === 'member' && $meeting['unit_id'] !== $user['unit_id']) {
        return redirect()->to('/meetings')->with('error', 'Bu toplantıya erişim izniniz yok.');
    }

    $users   = (new UserModel())->where('unit_id', $meeting['unit_id'])->findAll();

    // 🔹 1) Kullanıcıları çek
    $mpModel = new MeetingParticipantModel();

    // 🔹 2) Varsayılan yoklama KONTROL + INSERT
    $existingCount = $mpModel
        ->where('meeting_id', $id)
        ->countAllResults();
---
SELECT *
FROM `meetings`
WHERE `meetings`.`deleted_at` IS NULL
AND `meetings`.`id` = 111
SELECT *
FROM `users`
WHERE `unit_id` = '2'
AND `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `meeting_participants`
WHERE `meeting_id` = 111

    // 🔹 3) Artık participants’i güvenle çek
    $participants = $mpModel->where('meeting_id', $id)->findAll();

    $agendaItems = (new AgendaItemModel())
        ->select('agenda_items.*, users.name as author_name, users.role as author_role')
        ->join('users', 'users.id = agenda_items.author_id', 'left')
        ->where('meeting_id', $id)
        ->orderBy('agenda_items.id', 'asc')
        ->findAll();
---
SELECT `agenda_items`.*, `users`.`name` as `author_name`, `users`.`role` as `author_role`
FROM `agenda_items`
LEFT JOIN `users` ON `users`.`id` = `agenda_items`.`author_id`
WHERE `meeting_id` = 111
AND `agenda_items`.`deleted_at` IS NULL
ORDER BY `agenda_items`.`id` ASC

    if ($agendaItems) {
        $ids = array_column($agendaItems, 'id');
        if (!empty($ids)) {
            $decisions = (new DecisionModel())->whereIn('agenda_item_id', $ids)->findAll();
---
SELECT *
FROM `decisions`
WHERE `agenda_item_id` IN ('156','157')
AND `decisions`.`deleted_at` IS NULL