app/Controllers/ReportsController.php

SELECT *
FROM `meetings`
WHERE `unit_id` = '3'
AND `meetings`.`deleted_at` IS NULL
ORDER BY `start_at` DESC
 LIMIT 10
SELECT *
FROM `users`
WHERE `unit_id` = '3'
AND `users`.`deleted_at` IS NULL
---
    private function attendanceSummary()
{
    $meetingModel = new MeetingModel();
    $unitModel    = new UnitModel();
    $userModel    = new UserModel();
    $mpModel      = new MeetingParticipantModel();

    $units = $unitModel->orderBy('name')->findAll();
    $unitSummary = [];

    foreach ($units as $unit) {

        // Bu birime ait son 10 toplantı alınır
        $meetings = $meetingModel
            ->where('unit_id', $unit['id'])
            ->orderBy('start_at', 'DESC')
            ->limit(10)
            ->findAll();

        $meetingIds = array_column($meetings, 'id');

        // Bu birime ait kullanıcılar alınır
        $users = $userModel
            ->where('unit_id', $unit['id'])
            ->findAll();