app/Controllers/UnitsController.php

public function index()
{
    $user = session('user');
    if (!$user) {
        return redirect()->to('/login');
    }

    // Rol seçimi
    $realRole = $user['role'] ?? 'member';
    $demoRole = session('demo_role');
    $roleUsed = $demoRole ?: $realRole;

    // ❌ SUPERADMIN değilse erişim yok
    if ($roleUsed !== 'superadmin') {
        return redirect()->to('/meetings');
    }

    $unitModel = $this->unitModel;
    $userModel = new UserModel();

    $units = $unitModel
        ->select('units.*, users.name AS manager_name')
        ->join('users', 'users.id = units.manager_id', 'left')
        ->orderBy('units.id', 'DESC')
        ->findAll();

    $managers = $userModel
        ->where('role', 'manager')
        ->orderBy('name')
        ->findAll();
---
SELECT `units`.*, `users`.`name` AS `manager_name`
FROM `units`
LEFT JOIN `users` ON `users`.`id` = `units`.`manager_id`
WHERE `units`.`deleted_at` IS NULL
ORDER BY `units`.`id` DESC
SELECT *
FROM `users`
WHERE `role` = 'manager'
AND `users`.`deleted_at` IS NULL
ORDER BY `name`