app/Controllers/UsersController.php

SELECT `users`.*, `units`.`name` AS `unit_name`
FROM `users`
LEFT JOIN `units` ON `units`.`id` = `users`.`unit_id`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `users`.`id` DESC
SELECT *
FROM `units`
WHERE `units`.`deleted_at` IS NULL
ORDER BY `name`
---
   public function index()
{
    $user = session('user');
    if (!$user) {
        return redirect()->to('/login');
    }

    // 🔥 Rol belirleme
    $realRole = $user['role'] ?? 'member';
    $demoRole = session('demo_role');
    $roleUsed = $demoRole ?: $realRole;

    // 🔥 Kullanıcının gerçek birimi
    $unitId = $user['unit_id'] ?? null;

    $model = new \App\Models\UserModel();
    $model = $model
        ->select('users.*, units.name AS unit_name')
        ->join('units', 'units.id = users.unit_id', 'left');

    // 👉 SUPERADMIN
    if ($roleUsed === 'superadmin') {

        $selectedUnit = session('selected_unit_id');

        if ($selectedUnit) {
            $model->where('users.unit_id', $selectedUnit);
        }

        $unitModel = new \App\Models\UnitModel();
        $units = $unitModel->orderBy('name')->findAll();